In [2]:
# Importing libraries

import numpy as np    # linear algebra
import pandas as pd   # data processing
import pickle
import seaborn as sns
import matplotlib.pyplot as plt

### DATAFRAME CREATION

In [13]:
# Reading the data files
with open('dataset/adult.data','r') as adult_data:
    row_data = adult_data.readlines()

# Creating an array to store the data by rows in order to change it to differnt columns
data_rows = []
#Arranging the data columns doing necessary splittings
for data_row in row_data:
    data_rows.append(data_row)

# Splitting the dataset to necessary columns
adult_data_array = []
for data_row in data_rows:
    adult_data_array.append(data_row.split(','))

### DATASET ANALYSIS

In [14]:
# Reading the dataset
adult_data = pd.DataFrame(adult_data_array)
# displaying the head of the dataset
adult_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K\n
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K\n
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K\n
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K\n
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K\n

In [15]:
# Number of instances and attributes
adult_data.shape

(32562, 15)

In [16]:
adult_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32562 entries, 0 to 32561
Data columns (total 15 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       32562 non-null  object
 1   1       32561 non-null  object
 2   2       32561 non-null  object
 3   3       32561 non-null  object
 4   4       32561 non-null  object
 5   5       32561 non-null  object
 6   6       32561 non-null  object
 7   7       32561 non-null  object
 8   8       32561 non-null  object
 9   9       32561 non-null  object
 10  10      32561 non-null  object
 11  11      32561 non-null  object
 12  12      32561 non-null  object
 13  13      32561 non-null  object
 14  14      32561 non-null  object
dtypes: object(15)
memory usage: 3.7+ MB

In [17]:
# Sum of the missing cells of each attribute
adult_data.isna().sum()

0     0
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
11    1
12    1
13    1
14    1
dtype: int64